Revit 2027 API
ParameterTypeId.FabricationPartDepthInOption Property
 "Main Primary Depth Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartDepthInOption { get; }
Public Shared ReadOnly Property FabricationPartDepthInOption As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartDepthInOption {
	ForgeTypeId^ get ();
}
static member FabricationPartDepthInOption : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace